zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_spi.h
/* SPI_CTL1 Bits */
/* SPI_CTL1[LBM] Bits */
#define SPI_CTL1_LBM_OFS                         (1)                             /* !< LBM Offset */
#define SPI_CTL1_LBM_MASK                        ((uint32_t)0x00000002U)         /* !< Loop back mode */
#define SPI_CTL1_LBM_DISABLE                     ((uint32_t)0x00000000U)         /* !< Disable loopback mode */
#define SPI_CTL1_LBM_ENABLE                      ((uint32_t)0x00000002U)         /* !< Enable loopback mode */
/* SPI_CTL1[CP] Bits */
#define SPI_CTL1_CP_OFS                          (2)                             /* !< CP Offset */
#define SPI_CTL1_CP_MASK                         ((uint32_t)0x00000004U)         /* !< Controller or peripheral mode
                                                                                    select. This bit can be modified only
                                                                                    when SPI is disabled, CTL1.ENABLE=0. */
#define SPI_CTL1_CP_DISABLE                      ((uint32_t)0x00000000U)         /* !< Select Peripheral mode */
#define SPI_CTL1_CP_ENABLE                       ((uint32_t)0x00000004U)         /* !< Select Controller Mode */
/* SPI_CTL1[POD] Bits */
#define SPI_CTL1_POD_OFS                         (3)                             /* !< POD Offset */
#define SPI_CTL1_POD_MASK                        ((uint32_t)0x00000008U)         /* !< Peripheral-mode: Data output
                                                                                    disabled This bit is relevant only in
                                                                                    Peripheral mode. In
                                                                                    multiple-peripheral system
                                                                                    topologies, SPI controller can
                                                                                    broadcast a message to all
                                                                                    peripherals, while only one
                                                                                    peripheral drives the line.  POD can
                                                                                    be used by the SPI peripheral to
                                                                                    disable driving data on the line. */
#define SPI_CTL1_POD_DISABLE                     ((uint32_t)0x00000000U)         /* !< SPI can drive the MISO output in
                                                                                    peripheral mode. */
#define SPI_CTL1_POD_ENABLE                      ((uint32_t)0x00000008U)         /* !< SPI cannot drive the MISO output in
                                                                                    peripheral mode. */
/* SPI_CTL1[MSB] Bits */
#define SPI_CTL1_MSB_OFS                         (4)                             /* !< MSB Offset */
#define SPI_CTL1_MSB_MASK                        ((uint32_t)0x00000010U)         /* !< MSB first select. Controls the
                                                                                    direction of the receive and transmit
                                                                                    shift register. */
#define SPI_CTL1_MSB_DISABLE                     ((uint32_t)0x00000000U)         /* !< LSB first */
#define SPI_CTL1_MSB_ENABLE                      ((uint32_t)0x00000010U)         /* !< MSB first */
/* SPI_CTL1[PREN] Bits */
#define SPI_CTL1_PREN_OFS                        (5)                             /* !< PREN Offset */
#define SPI_CTL1_PREN_MASK                       ((uint32_t)0x00000020U)         /* !< Parity receive enable If enabled,
                                                                                    parity reception check will be done
                                                                                    for both controller and peripheral
                                                                                    modes In case of a parity miss-match
                                                                                    the parity error flag RIS.PER will be
                                                                                    set. */
#define SPI_CTL1_PREN_DISABLE                    ((uint32_t)0x00000000U)         /* !< Disable Parity receive function */
#define SPI_CTL1_PREN_ENABLE                     ((uint32_t)0x00000020U)         /* !< Enable Parity receive function */
/* SPI_CTL1[REPEATTX] Bits */
#define SPI_CTL1_REPEATTX_OFS                    (16)                            /* !< REPEATTX Offset */
#define SPI_CTL1_REPEATTX_MASK                   ((uint32_t)0x00FF0000U)         /* !< Counter to repeat last transfer 0:
                                                                                    repeat last transfer is disabled. x:
                                                                                    repeat the last transfer with the
                                                                                    given number. The transfer will be
                                                                                    started with writing a data into the
                                                                                    TX Buffer. Sending the data will be
                                                                                    repeated with the given value, so the
                                                                                    data will be transferred X+1 times in
                                                                                    total. The behavior is identical as
                                                                                    if the data would be written into the
                                                                                    TX Buffer that many times as defined
                                                                                    by the value here. It can be used to
                                                                                    clean a transfer or to pull a certain
                                                                                    amount of data by a peripheral. */
#define SPI_CTL1_REPEATTX_DISABLE                ((uint32_t)0x00000000U)         /* !< REPEATTX disable */
#define SPI_CTL1_REPEATTX_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define SPI_CTL1_REPEATTX_MAXIMUM                ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* SPI_CTL1[PES] Bits */
#define SPI_CTL1_PES_OFS                         (6)                             /* !< PES Offset */
#define SPI_CTL1_PES_MASK                        ((uint32_t)0x00000040U)         /* !< Even Parity Select */
#define SPI_CTL1_PES_DISABLE                     ((uint32_t)0x00000000U)         /* !< Odd Parity mode */
#define SPI_CTL1_PES_ENABLE                      ((uint32_t)0x00000040U)         /* !< Even Parity mode */
/* SPI_CTL1[CDMODE] Bits */
#define SPI_CTL1_CDMODE_OFS                      (12)                            /* !< CDMODE Offset */
#define SPI_CTL1_CDMODE_MASK                     ((uint32_t)0x0000F000U)         /* !< Command/Data Mode Value  When
                                                                                    CTL1.CDENABLE is 1, CS3 line is used
                                                                                    as C/D signal to distinguish between
                                                                                    Command (C/D low) and Data (C/D high)
                                                                                    information.  When a value is written
                                                                                    into the CTL1.CDMODE bits, the C/D
                                                                                    (CS3) line will go low for the given
                                                                                    numbers of byte which are sent by the
                                                                                    SPI, starting with the next value to
                                                                                    be transmitted after which, C/D line
                                                                                    will go high automatically  0: Manual
                                                                                    mode with C/D signal as High 1-14:
                                                                                    C/D is low while this number of bytes
                                                                                    are being sent after which, this
                                                                                    field sets to 0 and C/D goes high.
                                                                                    Reading this field at any time
                                                                                    returns the remaining number of
                                                                                    command bytes. 15: Manual mode with
                                                                                    C/D signal as Low. */
#define SPI_CTL1_CDMODE_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define SPI_CTL1_CDMODE_DATA                     ((uint32_t)0x00000000U)         /* !< Manual mode: Data */
#define SPI_CTL1_CDMODE_MAXIMUM                  ((uint32_t)0x0000F000U)         /* !< Highest possible value */
#define SPI_CTL1_CDMODE_COMMAND                  ((uint32_t)0x0000F000U)         /* !< Manual mode: Command */
/* SPI_CTL1[ENABLE] Bits */
#define SPI_CTL1_ENABLE_OFS                      (0)                             /* !< ENABLE Offset */
#define SPI_CTL1_ENABLE_MASK                     ((uint32_t)0x00000001U)         /* !< SPI enable */
#define SPI_CTL1_ENABLE_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disable module function */
#define SPI_CTL1_ENABLE_ENABLE                   ((uint32_t)0x00000001U)         /* !< Enable module function */
/* SPI_CTL1[RXTIMEOUT] Bits */
#define SPI_CTL1_RXTIMEOUT_OFS                   (24)                            /* !< RXTIMEOUT Offset */
#define SPI_CTL1_RXTIMEOUT_MASK                  ((uint32_t)0x3F000000U)         /* !< Receive Timeout (only for
                                                                                    Peripheral mode) Defines the number
                                                                                    of Clock Cycles before after which
                                                                                    the Receive Timeout flag RTOUT is
                                                                                    set. The time is calculated using the
                                                                                    control register for the clock
                                                                                    selection and divider in the
                                                                                    Controller mode configuration. A
                                                                                    value of 0 disables this function. */
#define SPI_CTL1_RXTIMEOUT_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define SPI_CTL1_RXTIMEOUT_MAXIMUM               ((uint32_t)0x3F000000U)         /* !< Highest possible value */
/* SPI_CTL1[CDENABLE] Bits */
#define SPI_CTL1_CDENABLE_OFS                    (11)                            /* !< CDENABLE Offset */
#define SPI_CTL1_CDENABLE_MASK                   ((uint32_t)0x00000800U)         /* !< Command/Data Mode enable */
#define SPI_CTL1_CDENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< CS3 is used for Chip Select */
#define SPI_CTL1_CDENABLE_ENABLE                 ((uint32_t)0x00000800U)         /* !< CS3 is used as CD signal */
/* SPI_CTL1[PTEN] Bits */
#define SPI_CTL1_PTEN_OFS                        (8)                             /* !< PTEN Offset */
#define SPI_CTL1_PTEN_MASK                       ((uint32_t)0x00000100U)         /* !< Parity transmit enable If enabled,
                                                                                    parity transmission will be done for
                                                                                    both controller and peripheral modes. */
#define SPI_CTL1_PTEN_DISABLE                    ((uint32_t)0x00000000U)         /* !< Parity transmission is disabled */
#define SPI_CTL1_PTEN_ENABLE                     ((uint32_t)0x00000100U)         /* !< Parity transmission is enabled */

/* SPI_CLKCTL Bits */
/* SPI_CLKCTL[SCR] Bits */
#define SPI_CLKCTL_SCR_OFS                       (0)                             /* !< SCR Offset */
#define SPI_CLKCTL_SCR_MASK                      ((uint32_t)0x000003FFU)         /* !< Serial clock divider: This is used
                                                                                    to generate the transmit and receive
                                                                                    bit rate of the SPI. The SPI bit rate
                                                                                    is (SPI's functional clock
                                                                                    frequency)/((SCR+1)*2). SCR is a
                                                                                    value from 0-1023. */
#define SPI_CLKCTL_SCR_MINIMUM                   ((uint32_t)0x00000000U)         /* !< Smallest value */
#define SPI_CLKCTL_SCR_MAXIMUM                   ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* SPI_CLKCTL[DSAMPLE] Bits */
#define SPI_CLKCTL_DSAMPLE_OFS                   (28)                            /* !< DSAMPLE Offset */
#define SPI_CLKCTL_DSAMPLE_MASK                  ((uint32_t)0xF0000000U)         /* !< Delayed sampling value.  In
                                                                                    controller mode the data on the input
                                                                                    pin will be delayed sampled by the
                                                                                    defined clock cycles of internal
                                                                                    functional clock hence relaxing the
                                                                                    setup time of input data. This
                                                                                    setting is useful in systems where
                                                                                    the board delays and external
                                                                                    peripheral delays are more than the
                                                                                    input setup time of the controller.
                                                                                    Please refer to the datasheet for
                                                                                    values of controller input setup time
                                                                                    and assess what DSAMPLE value meets
                                                                                    the requirement of the system. Note:
                                                                                    High values of DSAMPLE can cause HOLD
                                                                                    time violations and must be factored
                                                                                    in the calculations. */
#define SPI_CLKCTL_DSAMPLE_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define SPI_CLKCTL_DSAMPLE_MAXIMUM               ((uint32_t)0xF0000000U)         /* !< Highest possible value */

/* SPI_IFLS Bits */
/* SPI_IFLS[TXIFLSEL] Bits */
#define SPI_IFLS_TXIFLSEL_OFS                    (0)                             /* !< TXIFLSEL Offset */
#define SPI_IFLS_TXIFLSEL_MASK                   ((uint32_t)0x00000007U)         /* !< SPI Transmit Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    transmit interrupt are as follows: */
#define SPI_IFLS_TXIFLSEL_LVL_OFF                ((uint32_t)0x00000000U)         /* !< Reserved */
#define SPI_IFLS_TXIFLSEL_LVL_3_4                ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define SPI_IFLS_TXIFLSEL_LVL_1_2                ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define SPI_IFLS_TXIFLSEL_LVL_1_4                ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define SPI_IFLS_TXIFLSEL_LVL_RES4               ((uint32_t)0x00000004U)         /* !< Reserved */
#define SPI_IFLS_TXIFLSEL_LVL_EMPTY              ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define SPI_IFLS_TXIFLSEL_LVL_RES6               ((uint32_t)0x00000006U)         /* !< Reserved */
#define SPI_IFLS_TXIFLSEL_LEVEL_1                ((uint32_t)0x00000007U)         /* !< Trigger when TX FIFO has >= 1 frame
                                                                                    free Should be used with DMA */
/* SPI_IFLS[RXIFLSEL] Bits */
#define SPI_IFLS_RXIFLSEL_OFS                    (3)                             /* !< RXIFLSEL Offset */
#define SPI_IFLS_RXIFLSEL_MASK                   ((uint32_t)0x00000038U)         /* !< SPI Receive Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    receive interrupt are as follows: */
#define SPI_IFLS_RXIFLSEL_LVL_OFF                ((uint32_t)0x00000000U)         /* !< Reserved */
#define SPI_IFLS_RXIFLSEL_LVL_1_4                ((uint32_t)0x00000008U)         /* !< RX FIFO >= 1/4 full */
#define SPI_IFLS_RXIFLSEL_LVL_1_2                ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/2 full (default) */
#define SPI_IFLS_RXIFLSEL_LVL_3_4                ((uint32_t)0x00000018U)         /* !< RX FIFO >= 3/4 full */
#define SPI_IFLS_RXIFLSEL_LVL_RES4               ((uint32_t)0x00000020U)         /* !< Reserved */
#define SPI_IFLS_RXIFLSEL_LVL_FULL               ((uint32_t)0x00000028U)         /* !< RX FIFO is full */
#define SPI_IFLS_RXIFLSEL_LVL_RES6               ((uint32_t)0x00000030U)         /* !< Reserved */
#define SPI_IFLS_RXIFLSEL_LEVEL_1                ((uint32_t)0x00000038U)         /* !< Trigger when RX FIFO contains >= 1
                                                                                    frame */

/* SPI_STAT Bits */
/* SPI_STAT[TFE] Bits */
#define SPI_STAT_TFE_OFS                         (0)                             /* !< TFE Offset */
#define SPI_STAT_TFE_MASK                        ((uint32_t)0x00000001U)         /* !< Transmit FIFO empty. */
#define SPI_STAT_TFE_NOT_EMPTY                   ((uint32_t)0x00000000U)         /* !< Transmit FIFO is not empty. */
#define SPI_STAT_TFE_EMPTY                       ((uint32_t)0x00000001U)         /* !< Transmit FIFO is empty. */
/* SPI_STAT[TNF] Bits */
#define SPI_STAT_TNF_OFS                         (1)                             /* !< TNF Offset */
#define SPI_STAT_TNF_MASK                        ((uint32_t)0x00000002U)         /* !< Transmit FIFO not full */
#define SPI_STAT_TNF_FULL                        ((uint32_t)0x00000000U)         /* !< Transmit FIFO is full. */
#define SPI_STAT_TNF_NOT_FULL                    ((uint32_t)0x00000002U)         /* !< Transmit FIFO is not full. */
/* SPI_STAT[RFE] Bits */
#define SPI_STAT_RFE_OFS                         (2)                             /* !< RFE Offset */
#define SPI_STAT_RFE_MASK                        ((uint32_t)0x00000004U)         /* !< Receive FIFO empty. */
#define SPI_STAT_RFE_NOT_EMPTY                   ((uint32_t)0x00000000U)         /* !< Receive FIFO is not empty. */
#define SPI_STAT_RFE_EMPTY                       ((uint32_t)0x00000004U)         /* !< Receive FIFO is empty. */
/* SPI_STAT[RNF] Bits */
#define SPI_STAT_RNF_OFS                         (3)                             /* !< RNF Offset */
#define SPI_STAT_RNF_MASK                        ((uint32_t)0x00000008U)         /* !< Receive FIFO not full */
#define SPI_STAT_RNF_FULL                        ((uint32_t)0x00000000U)         /* !< Receive FIFO is full. */
#define SPI_STAT_RNF_NOT_FULL                    ((uint32_t)0x00000008U)         /* !< Receive FIFO is not full. */
/* SPI_STAT[BUSY] Bits */
#define SPI_STAT_BUSY_OFS                        (4)                             /* !< BUSY Offset */
#define SPI_STAT_BUSY_MASK                       ((uint32_t)0x00000010U)         /* !< Busy */
#define SPI_STAT_BUSY_IDLE                       ((uint32_t)0x00000000U)         /* !< SPI is in idle mode. */
#define SPI_STAT_BUSY_ACTIVE                     ((uint32_t)0x00000010U)         /* !< SPI is currently transmitting
                                                                                    and/or receiving data, or transmit
                                                                                    FIFO is not empty. */

/* SPI_RXDATA Bits */
/* SPI_RXDATA[DATA] Bits */
#define SPI_RXDATA_DATA_OFS                      (0)                             /* !< DATA Offset */
#define SPI_RXDATA_DATA_MASK                     ((uint32_t)0x0000FFFFU)         /* !< Received Data When PACKEN=1,two
                                                                                    entries of the FIFO are returned as a
                                                                                    32-bit value. When PACKEN=0, 1 entry
                                                                                    of FIFO is returned as 16-bit value.
                                                                                    As data values are removed by the
                                                                                    receive logic from the incoming data
                                                                                    frame, they are placed into the entry
                                                                                    in the receive FIFO, pointed to by
                                                                                    the current FIFO write pointer.
                                                                                    Received data less than 16 bits is
                                                                                    automatically right justified in the
                                                                                    receive buffer. */
#define SPI_RXDATA_DATA_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define SPI_RXDATA_DATA_MAXIMUM                  ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

